app/views/employee_masters/show.html.erb

SELECT `dtr_masters`.* FROM `dtr_masters` WHERE `dtr_masters`.`employee_master_id` = 2
---
<h2>TimeIN/TimeOUT</h2>
<% @employee_master.dtr_masters.each do |dtr_master| %>