app/controllers/dtr_masters_controller.rb

	 def create
    @employee_master = EmployeeMaster.find(params[:employee_master_id])
    @dtr_masters = @employee_master.dtr_masters.create(dtr_master_params)
---
SELECT  `employee_masters`.* FROM `employee_masters` WHERE `employee_masters`.`id` = 2 LIMIT 1
INSERT INTO `dtr_masters` (`EmployeeMaster_EmployeeID`, `DTRDateTime`, `DTRType`, `created_at`, `updated_at`) VALUES (2, '2019-05-06 20:13:00', 'in', '2019-05-06 20:13:05', '2019-05-06 20:13:05')