app/controllers/employee_masters_controller.rb

SELECT `employee_masters`.* FROM `employee_masters`
---
  def index
    @employee_masters = EmployeeMaster.all

INSERT INTO `employee_masters` (`EmployeeID`, `EmployeeFirstName`, `EmployeeLastName`, `EmployeeBday`, `created_at`, `updated_at`) VALUES (222, '222', '2222', '2019-05-06 17:45:00', '2019-05-06 17:45:36', '2019-05-06 17:45:36')
---
  def create
    @employee_master = EmployeeMaster.new(employee_master_params)

    respond_to do |format|
      if @employee_master.save

UPDATE `employee_masters` SET `EmployeeLastName` = '21212fsdfds', `updated_at` = '2019-05-06 17:55:00' WHERE `employee_masters`.`id` = 2
---
  def update
    respond_to do |format|
      if @employee_master.update(employee_master_params)

DELETE FROM `employee_masters` WHERE `employee_masters`.`id` = 1
---
  def destroy
    @employee_master.destroy

SELECT `dtr_masters`.* FROM `dtr_masters` WHERE `dtr_masters`.`EmployeeMaster_EmployeeID` = 2
SELECT  `employee_masters`.* FROM `employee_masters` WHERE `employee_masters`.`id` = 2 LIMIT 1
---
    def set_employee_master
      @employee_master = EmployeeMaster.find(params[:id])